Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Saheeh International.tmx
Source language: ar
Languages: en

source: وآية لهم الليل نسلخ منه النهار فإذا هم مظلمون
en: And a sign for them is the night. We remove from it [the light of] day, so they are [left] in darkness.

source: والشمس تجري لمستقر لها ذلك تقدير العزيز العليم
en: And the sun runs [on course] toward its stopping point. That is the determination of the Exalted in Might, the Knowing.

source: والقمر قدرناه منازل حتى عاد كالعرجون القديم
en: And the moon - We have determined for it phases, until it returns [appearing] like the old date stalk.

source: لا الشمس ينبغي لها أن تدرك القمر ولا الليل سابق النهار وكل في فلك يسبحون
en: It is not allowable for the sun to reach the moon, nor does the night overtake the day, but each, in an orbit, is swimming.

source: وآية لهم أنا حملنا ذريتهم في الفلك المشحون
en: And a sign for them is that We carried their forefathers in a laden ship.

source: وخلقنا لهم من مثله ما يركبون
en: And We created for them from the likes of it that which they ride.

source: وإن نشأ نغرقهم فلا صريخ لهم ولا هم ينقذون
en: And if We should will, We could drown them; then no one responding to a cry would there be for them, nor would they be saved

source: إلا رحمة منا ومتاعا إلى حين
en: Except as a mercy from Us and provision for a time.

source: وإذا قيل لهم اتقوا ما بين أيديكم وما خلفكم لعلكم ترحمون
en: But when it is said to them, "Beware of what is before you and what is behind you; perhaps you will receive mercy... "

source: وإذا قيل لهم أنفقوا مما رزقكم الله قال الذين كفروا للذين آمنوا أنطعم من لو يشاء الله أطعمه إن أنتم إلا في ضلال مبين
en: And when it is said to them, "Spend from that which Allah has provided for you," those who disbelieve say to those who believe, "Should we feed one whom, if Allah had willed, He would have fed? You are not but in clear error."

source: ما ينظرون إلا صيحة واحدة تأخذهم وهم يخصمون
en: They do not await except one blast which will seize them while they are disputing.

source: فلا يستطيعون توصية ولا إلى أهلهم يرجعون
en: And they will not be able [to give] any instruction, nor to their people can they return.

source: ونفخ في الصور فإذا هم من الأجداث إلى ربهم ينسلون
en: And the Horn will be blown; and at once from the graves to their Lord they will hasten.

source: قالوا يا ويلنا من بعثنا من مرقدنا هذا ما وعد الرحمن وصدق المرسلون
en: They will say, "O woe to us! Who has raised us up from our sleeping place?" [The reply will be], "This is what the Most Merciful had promised, and the messengers told the truth."

source: إن كانت إلا صيحة واحدة فإذا هم جميع لدينا محضرون
en: It will not be but one blast, and at once they are all brought present before Us.

source: فاليوم لا تظلم نفس شيئا ولا تجزون إلا ما كنتم تعملون
en: So today no soul will be wronged at all, and you will not be recompensed except for what you used to do.

source: إن أصحاب الجنة اليوم في شغل فاكهون
en: Indeed the companions of Paradise, that Day, will be amused in [joyful] occupation -

source: هم وأزواجهم في ظلال على الأرائك متكئون
en: They and their spouses - in shade, reclining on adorned couches.

source: لهم فيها فاكهة ولهم ما يدعون
en: For them therein is fruit, and for them is whatever they request [or wish]

source: سلام قولا من رب رحيم
en: [And] "Peace," a word from a Merciful Lord.

source: وامتازوا اليوم أيها المجرمون
en: [Then He will say], "But stand apart today, you criminals.

source: ألم أعهد إليكم يا بني آدم أن لا تعبدوا الشيطان إنه لكم عدو مبين
en: Did I not enjoin upon you, O children of Adam, that you not worship Satan - [for] indeed, he is to you a clear enemy -

source: وأن اعبدوني هذا صراط مستقيم
en: And that you worship [only] Me? This is a straight path.

source: ولقد أضل منكم جبلا كثيرا أفلم تكونوا تعقلون
en: And he had already led astray from among you much of creation, so did you not use reason?

source: هذه جهنم التي كنتم توعدون
en: This is the Hellfire which you were promised.

source: اصلوها اليوم بما كنتم تكفرون
en: [Enter to] burn therein today for what you used to deny."

source: اليوم نختم على أفواههم وتكلمنا أيديهم وتشهد أرجلهم بما كانوا يكسبون
en: That Day, We will seal over their mouths, and their hands will speak to Us, and their feet will testify about what they used to earn.

source: ولو نشاء لطمسنا على أعينهم فاستبقوا الصراط فأنى يبصرون
en: And if We willed, We could have obliterated their eyes, and they would race to [find] the path, and how could they see?

source: ولو نشاء لمسخناهم على مكانتهم فما استطاعوا مضيا ولا يرجعون
en: And if We willed, We could have deformed them, [paralyzing them] in their places so they would not be able to proceed, nor could they return.

source: ومن نعمره ننكسه في الخلق أفلا يعقلون
en: And he to whom We grant long life We reverse in creation; so will they not understand?

source: وما علمناه الشعر وما ينبغي له إن هو إلا ذكر وقرآن مبين
en: And We did not give Prophet Muhammad, knowledge of poetry, nor is it befitting for him. It is not but a message and a clear Qur'an

source: لينذر من كان حيا ويحق القول على الكافرين
en: To warn whoever is alive and justify the word against the disbelievers.

source: أولم يروا أنا خلقنا لهم مما عملت أيدينا أنعاما فهم لها مالكون
en: Do they not see that We have created for them from what Our hands have made, grazing livestock, and [then] they are their owners?

source: وذللناها لهم فمنها ركوبهم ومنها يأكلون
en: And We have tamed them for them, so some of them they ride, and some of them they eat.

source: ولهم فيها منافع ومشارب أفلا يشكرون
en: And for them therein are [other] benefits and drinks, so will they not be grateful?

source: واتخذوا من دون الله آلهة لعلهم ينصرون
en: But they have taken besides Allah [false] deities that perhaps they would be helped.

source: لا يستطيعون نصرهم وهم لهم جند محضرون
en: They are not able to help them, and they [themselves] are for them soldiers in attendance.

source: فلا يحزنك قولهم إنا نعلم ما يسرون وما يعلنون
en: So let not their speech grieve you. Indeed, We know what they conceal and what they declare.

source: أولم ير الإنسان أنا خلقناه من نطفة فإذا هو خصيم مبين
en: Does man not consider that We created him from a [mere] sperm-drop - then at once he is a clear adversary?

source: وضرب لنا مثلا ونسي خلقه قال من يحيي العظام وهي رميم
en: And he presents for Us an example and forgets his [own] creation. He says, "Who will give life to bones while they are disintegrated?"

source: قل يحييها الذي أنشأها أول مرة وهو بكل خلق عليم
en: Say, "He will give them life who produced them the first time; and He is, of all creation, Knowing."

source: الذي جعل لكم من الشجر الأخضر نارا فإذا أنتم منه توقدون
en: [It is] He who made for you from the green tree, fire, and then from it you ignite.

source: أوليس الذي خلق السماوات والأرض بقادر على أن يخلق مثلهم بلى وهو الخلاق العليم
en: Is not He who created the heavens and the earth Able to create the likes of them? Yes, [it is so]; and He is the Knowing Creator.

source: إنما أمره إذا أراد شيئا أن يقول له كن فيكون
en: His command is only when He intends a thing that He says to it, "Be," and it is.

source: فسبحان الذي بيده ملكوت كل شيء وإليه ترجعون
en: So exalted is He in whose hand is the realm of all things, and to Him you will be returned.

source: والصافات صفا
en: By those [angels] lined up in rows

source: فالزاجرات زجرا
en: And those who drive [the clouds]

source: فالتاليات ذكرا
en: And those who recite the message,

source: إن إلهكم لواحد
en: Indeed, your God is One,

source: رب السماوات والأرض وما بينهما ورب المشارق
en: Lord of the heavens and the earth and that between them and Lord of the sunrises.

source: إنا زينا السماء الدنيا بزينة الكواكب
en: Indeed, We have adorned the nearest heaven with an adornment of stars

source: وحفظا من كل شيطان مارد
en: And as protection against every rebellious devil

source: لا يسمعون إلى الملإ الأعلى ويقذفون من كل جانب
en: [So] they may not listen to the exalted assembly [of angels] and are pelted from every side,

source: دحورا ولهم عذاب واصب
en: Repelled; and for them is a constant punishment,

source: إلا من خطف الخطفة فأتبعه شهاب ثاقب
en: Except one who snatches [some words] by theft, but they are pursued by a burning flame, piercing [in brightness].

source: فاستفتهم أهم أشد خلقا أم من خلقنا إنا خلقناهم من طين لازب
en: Then inquire of them, [O Muhammad], "Are they a stronger [or more difficult] creation or those [others] We have created?" Indeed, We created men from sticky clay.

source: بل عجبت ويسخرون
en: But you wonder, while they mock,

source: وإذا ذكروا لا يذكرون
en: And when they are reminded, they remember not.

source: وإذا رأوا آية يستسخرون
en: And when they see a sign, they ridicule

source: وقالوا إن هذا إلا سحر مبين
en: And say, "This is not but obvious magic.

source: أإذا متنا وكنا ترابا وعظاما أإنا لمبعوثون
en: When we have died and become dust and bones, are we indeed to be resurrected?

source: أوآباؤنا الأولون
en: And our forefathers [as well]?"

source: قل نعم وأنتم داخرون
en: Say, "Yes, and you will be [rendered] contemptible."

source: فإنما هي زجرة واحدة فإذا هم ينظرون
en: It will be only one shout, and at once they will be observing.

source: وقالوا يا ويلنا هذا يوم الدين
en: They will say, "O woe to us! This is the Day of Recompense."

source: هذا يوم الفصل الذي كنتم به تكذبون
en: [They will be told], "This is the Day of Judgement which you used to deny."

source: احشروا الذين ظلموا وأزواجهم وما كانوا يعبدون
en: [The angels will be ordered], "Gather those who committed wrong, their kinds, and what they used to worship

source: من دون الله فاهدوهم إلى صراط الجحيم
en: Other than Allah, and guide them to the path of Hellfire

source: وقفوهم إنهم مسئولون
en: And stop them; indeed, they are to be questioned."

source: ما لكم لا تناصرون
en: [They will be asked], "What is [wrong] with you? Why do you not help each other?"

source: بل هم اليوم مستسلمون
en: But they, that Day, are in surrender.

source: وأقبل بعضهم على بعض يتساءلون
en: And they will approach one another blaming each other.

source: قالوا إنكم كنتم تأتوننا عن اليمين
en: They will say, "Indeed, you used to come at us from the right."

source: قالوا بل لم تكونوا مؤمنين
en: The oppressors will say, "Rather, you [yourselves] were not believers,

source: وما كان لنا عليكم من سلطان بل كنتم قوما طاغين
en: And we had over you no authority, but you were a transgressing people.

source: فحق علينا قول ربنا إنا لذائقون
en: So the word of our Lord has come into effect upon us; indeed, we will taste [punishment].

source: فأغويناكم إنا كنا غاوين
en: And we led you to deviation; indeed, we were deviators."

source: فإنهم يومئذ في العذاب مشتركون
en: So indeed they, that Day, will be sharing in the punishment.

source: إنا كذلك نفعل بالمجرمين
en: Indeed, that is how We deal with the criminals.

source: إنهم كانوا إذا قيل لهم لا إله إلا الله يستكبرون
en: Indeed they, when it was said to them, "There is no deity but Allah," were arrogant

source: ويقولون أئنا لتاركو آلهتنا لشاعر مجنون
en: And were saying, "Are we to leave our gods for a mad poet?"

source: بل جاء بالحق وصدق المرسلين
en: Rather, the Prophet has come with the truth and confirmed the [previous] messengers.

source: إنكم لذائقو العذاب الأليم
en: Indeed, you [disbelievers] will be tasters of the painful punishment,

source: وما تجزون إلا ما كنتم تعملون
en: And you will not be recompensed except for what you used to do -

source: إلا عباد الله المخلصين
en: But not the chosen servants of Allah.

source: أولئك لهم رزق معلوم
en: Those will have a provision determined -

source: فواكه وهم مكرمون
en: Fruits; and they will be honored

source: في جنات النعيم
en: In gardens of pleasure

source: على سرر متقابلين
en: On thrones facing one another.

source: يطاف عليهم بكأس من معين
en: There will be circulated among them a cup [of wine] from a flowing spring,

source: بيضاء لذة للشاربين
en: White and delicious to the drinkers;

source: لا فيها غول ولا هم عنها ينزفون
en: No bad effect is there in it, nor from it will they be intoxicated.

source: وعندهم قاصرات الطرف عين
en: And with them will be women limiting [their] glances, with large, [beautiful] eyes,

source: كأنهن بيض مكنون
en: As if they were [delicate] eggs, well-protected.

source: فأقبل بعضهم على بعض يتساءلون
en: And they will approach one another, inquiring of each other.

source: قال قائل منهم إني كان لي قرين
en: A speaker among them will say, "Indeed, I had a companion [on earth]

source: يقول أإنك لمن المصدقين
en: Who would say, 'Are you indeed of those who believe

source: أإذا متنا وكنا ترابا وعظاما أإنا لمدينون
en: That when we have died and become dust and bones, we will indeed be recompensed?'"

source: قال هل أنتم مطلعون
en: He will say, "Would you [care to] look?"

source: فاطلع فرآه في سواء الجحيم
en: And he will look and see him in the midst of the Hellfire.

source: قال تالله إن كدت لتردين
en: He will say, "By Allah, you almost ruined me.

source: ولولا نعمة ربي لكنت من المحضرين
en: If not for the favor of my Lord, I would have been of those brought in [to Hell].

source: أفما نحن بميتين
en: Then, are we not to die

source: إلا موتتنا الأولى وما نحن بمعذبين
en: Except for our first death, and we will not be punished?"

source: إن هذا لهو الفوز العظيم
en: Indeed, this is the great attainment.

source: لمثل هذا فليعمل العاملون
en: For the like of this let the workers [on earth] work.

source: أذلك خير نزلا أم شجرة الزقوم
en: Is Paradise a better accommodation or the tree of zaqqum?

source: إنا جعلناها فتنة للظالمين
en: Indeed, We have made it a torment for the wrongdoers.

source: إنها شجرة تخرج في أصل الجحيم
en: Indeed, it is a tree issuing from the bottom of the Hellfire,

source: طلعها كأنه رءوس الشياطين
en: Its emerging fruit as if it was heads of the devils.

source: فإنهم لآكلون منها فمالئون منها البطون
en: And indeed, they will eat from it and fill with it their bellies.

source: ثم إن لهم عليها لشوبا من حميم
en: Then indeed, they will have after it a mixture of scalding water.

source: ثم إن مرجعهم لإلى الجحيم
en: Then indeed, their return will be to the Hellfire.

source: إنهم ألفوا آباءهم ضالين
en: Indeed they found their fathers astray.

source: فهم على آثارهم يهرعون
en: So they hastened [to follow] in their footsteps.

source: ولقد ضل قبلهم أكثر الأولين
en: And there had already strayed before them most of the former peoples,

source: ولقد أرسلنا فيهم منذرين
en: And We had already sent among them warners.

source: فانظر كيف كان عاقبة المنذرين
en: Then look how was the end of those who were warned -

source: ولقد نادانا نوح فلنعم المجيبون
en: And Noah had certainly called Us, and [We are] the best of responders.

source: ونجيناه وأهله من الكرب العظيم
en: And We saved him and his family from the great affliction.

source: وجعلنا ذريته هم الباقين
en: And We made his descendants those remaining [on the earth]

source: وتركنا عليه في الآخرين
en: And left for him [favorable mention] among later generations:

source: سلام على نوح في العالمين
en: "Peace upon Noah among the worlds."

source: إنا كذلك نجزي المحسنين
en: Indeed, We thus reward the doers of good.

source: إنه من عبادنا المؤمنين
en: Indeed, he was of Our believing servants.

source: وإن من شيعته لإبراهيم
en: And indeed, among his kind was Abraham,

source: إذ جاء ربه بقلب سليم
en: When he came to his Lord with a sound heart

source: إذ قال لأبيه وقومه ماذا تعبدون
en: [And] when he said to his father and his people, "What do you worship?

source: أئفكا آلهة دون الله تريدون
en: Is it falsehood [as] gods other than Allah you desire?

source: فما ظنكم برب العالمين
en: Then what is your thought about the Lord of the worlds?"

source: فنظر نظرة في النجوم
en: And he cast a look at the stars

source: فقال إني سقيم
en: And said, "Indeed, I am [about to be] ill."

source: فتولوا عنه مدبرين
en: So they turned away from him, departing.

source: فراغ إلى آلهتهم فقال ألا تأكلون
en: Then he turned to their gods and said, "Do you not eat?

source: ما لكم لا تنطقون
en: What is [wrong] with you that you do not speak?"

source: فراغ عليهم ضربا باليمين
en: And he turned upon them a blow with [his] right hand.

source: فأقبلوا إليه يزفون
en: Then the people came toward him, hastening.

source: قال أتعبدون ما تنحتون
en: He said, "Do you worship that which you [yourselves] carve,

source: والله خلقكم وما تعملون
en: While Allah created you and that which you do?"

source: قالوا ابنوا له بنيانا فألقوه في الجحيم
en: They said, "Construct for him a furnace and throw him into the burning fire."

source: فأرادوا به كيدا فجعلناهم الأسفلين
en: And they intended for him a plan, but We made them the most debased.

source: وقال إني ذاهب إلى ربي سيهدين
en: And [then] he said, "Indeed, I will go to [where I am ordered by] my Lord; He will guide me.

source: رب هب لي من الصالحين
en: My Lord, grant me [a child] from among the righteous."

source: فبشرناه بغلام حليم
en: So We gave him good tidings of a forbearing boy.

source: فلما بلغ معه السعي قال يا بني إني أرى في المنام أني أذبحك فانظر ماذا ترى قال يا أبت افعل ما تؤمر ستجدني إن شاء الله من الصابرين
en: And when he reached with him [the age of] exertion, he said, "O my son, indeed I have seen in a dream that I [must] sacrifice you, so see what you think." He said, "O my father, do as you are commanded. You will find me, if Allah wills, of the steadfast."

source: فلما أسلما وتله للجبين
en: And when they had both submitted and he put him down upon his forehead,

source: وناديناه أن يا إبراهيم
en: We called to him, "O Abraham,

source: قد صدقت الرؤيا إنا كذلك نجزي المحسنين
en: You have fulfilled the vision." Indeed, We thus reward the doers of good.

source: إن هذا لهو البلاء المبين
en: Indeed, this was the clear trial.

source: وفديناه بذبح عظيم
en: And We ransomed him with a great sacrifice,

source: سلام على إبراهيم
en: "Peace upon Abraham."

source: كذلك نجزي المحسنين
en: Indeed, We thus reward the doers of good.

source: وبشرناه بإسحاق نبيا من الصالحين
en: And We gave him good tidings of Isaac, a prophet from among the righteous.

source: وباركنا عليه وعلى إسحاق ومن ذريتهما محسن وظالم لنفسه مبين
en: And We blessed him and Isaac. But among their descendants is the doer of good and the clearly unjust to himself.

source: ولقد مننا على موسى وهارون
en: And We did certainly confer favor upon Moses and Aaron.

source: ونجيناهما وقومهما من الكرب العظيم
en: And We saved them and their people from the great affliction,

source: ونصرناهم فكانوا هم الغالبين
en: And We supported them so it was they who overcame.

source: وآتيناهما الكتاب المستبين
en: And We gave them the explicit Scripture,

source: وهديناهما الصراط المستقيم
en: And We guided them on the straight path.

source: وتركنا عليهما في الآخرين
en: And We left for them [favorable mention] among later generations:

source: سلام على موسى وهارون
en: "Peace upon Moses and Aaron."

source: إنهما من عبادنا المؤمنين
en: Indeed, they were of Our believing servants.

source: وإن إلياس لمن المرسلين
en: And indeed, Elias was from among the messengers,

source: إذ قال لقومه ألا تتقون
en: When he said to his people, "Will you not fear Allah?

source: أتدعون بعلا وتذرون أحسن الخالقين
en: Do you call upon Ba'l and leave the best of creators -

source: الله ربكم ورب آبائكم الأولين
en: Allah, your Lord and the Lord of your first forefathers?"

source: فكذبوه فإنهم لمحضرون
en: And they denied him, so indeed, they will be brought [for punishment],

source: سلام على إل ياسين
en: "Peace upon Elias."

source: وإن لوطا لمن المرسلين
en: And indeed, Lot was among the messengers.

source: إذ نجيناه وأهله أجمعين
en: [So mention] when We saved him and his family, all,

source: وإنكم لتمرون عليهم مصبحين
en: And indeed, you pass by them in the morning

source: وبالليل أفلا تعقلون
en: And at night. Then will you not use reason?

source: وإن يونس لمن المرسلين
en: And indeed, Jonah was among the messengers.

source: إذ أبق إلى الفلك المشحون
en: [Mention] when he ran away to the laden ship.

source: فساهم فكان من المدحضين
en: And he drew lots and was among the losers.

source: فالتقمه الحوت وهو مليم
en: Then the fish swallowed him, while he was blameworthy.

source: فلولا أنه كان من المسبحين
en: And had he not been of those who exalt Allah,

source: للبث في بطنه إلى يوم يبعثون
en: He would have remained inside its belly until the Day they are resurrected.

source: فنبذناه بالعراء وهو سقيم
en: But We threw him onto the open shore while he was ill.

source: وأنبتنا عليه شجرة من يقطين
en: And We caused to grow over him a gourd vine.

source: وأرسلناه إلى مائة ألف أو يزيدون
en: And We sent him to [his people of] a hundred thousand or more.

source: فآمنوا فمتعناهم إلى حين
en: And they believed, so We gave them enjoyment [of life] for a time.

source: فاستفتهم ألربك البنات ولهم البنون
en: So inquire of them, [O Muhammad], "Does your Lord have daughters while they have sons?

source: أم خلقنا الملائكة إناثا وهم شاهدون
en: Or did We create the angels as females while they were witnesses?"

source: ألا إنهم من إفكهم ليقولون
en: Unquestionably, it is out of their [invented] falsehood that they say,

source: ولد الله وإنهم لكاذبون
en: " Allah has begotten," and indeed, they are liars.

source: أصطفى البنات على البنين
en: Has He chosen daughters over sons?

source: ما لكم كيف تحكمون
en: What is [wrong] with you? How do you make judgement?

source: أفلا تذكرون
en: Then will you not be reminded?

source: أم لكم سلطان مبين
en: Or do you have a clear authority?

source: فأتوا بكتابكم إن كنتم صادقين
en: Then produce your scripture, if you should be truthful.

source: وجعلوا بينه وبين الجنة نسبا ولقد علمت الجنة إنهم لمحضرون
en: And they have claimed between Him and the jinn a lineage, but the jinn have already known that they [who made such claims] will be brought to [punishment].

source: سبحان الله عما يصفون
en: Exalted is Allah above what they describe,

source: فإنكم وما تعبدون
en: So indeed, you [disbelievers] and whatever you worship,

source: ما أنتم عليه بفاتنين
en: You cannot tempt [anyone] away from Him

source: إلا من هو صال الجحيم
en: Except he who is to [enter and] burn in the Hellfire.

source: وما منا إلا له مقام معلوم
en: [The angels say], "There is not among us any except that he has a known position.

source: وإنا لنحن الصافون
en: And indeed, we are those who line up [for prayer].

source: وإنا لنحن المسبحون
en: And indeed, we are those who exalt Allah."

source: وإن كانوا ليقولون
en: And indeed, the disbelievers used to say,

source: لو أن عندنا ذكرا من الأولين
en: "If we had a message from [those of] the former peoples,

source: لكنا عباد الله المخلصين
en: We would have been the chosen servants of Allah."

source: فكفروا به فسوف يعلمون
en: But they disbelieved in it, so they are going to know.

source: ولقد سبقت كلمتنا لعبادنا المرسلين
en: And Our word has already preceded for Our servants, the messengers,

source: إنهم لهم المنصورون
en: [That] indeed, they would be those given victory

source: وإن جندنا لهم الغالبون
en: And [that] indeed, Our soldiers will be those who overcome.

source: فتول عنهم حتى حين
en: So, [O Muhammad], leave them for a time.

source: وأبصرهم فسوف يبصرون
en: And see [what will befall] them, for they are going to see.

source: فإذا نزل بساحتهم فساء صباح المنذرين
en: But when it descends in their territory, then evil is the morning of those who were warned.

source: وتول عنهم حتى حين
en: And leave them for a time.

source: وأبصر فسوف يبصرون
en: And see, for they are going to see.

source: سبحان ربك رب العزة عما يصفون
en: Exalted is your Lord, the Lord of might, above what they describe.

source: وسلام على المرسلين
en: And peace upon the messengers.

source: والحمد لله رب العالمين
en: And praise to Allah, Lord of the worlds.

source: ص والقرآن ذي الذكر
en: Sad. By the Qur'an containing reminder...

source: بل الذين كفروا في عزة وشقاق
en: But those who disbelieve are in pride and dissension.

source: كم أهلكنا من قبلهم من قرن فنادوا ولات حين مناص
en: How many a generation have We destroyed before them, and they [then] called out; but it was not a time for escape.
